# ColumnTopAttachmentOffsetParam Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..ColumnTopAttachmentOffsetParam Property
ParameterTypeId Class See Also
---
"Offset From Attachment At Top"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId ColumnTopAttachmentOffsetParam { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property ColumnTopAttachmentOffsetParam As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ ColumnTopAttachmentOffsetParam {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace